betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_usart.h
/** @brief  Macro to disable the USART's one bit sample method
  * @param  __HANDLE__ specifies the USART Handle.
  * @retval None
  */
#define __DAL_USART_ONE_BIT_SAMPLE_DISABLE(__HANDLE__) ((__HANDLE__)->Instance->CTRL3\
                                                        &= (uint16_t)~((uint16_t)USART_CTRL3_SAMCFG))
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/** @brief  Enable USART
  * @param  __HANDLE__ specifies the USART Handle.
  *         USART Handle selects the USARTx peripheral (USART availability and x value depending on device).
  * @retval None
  */
#define __DAL_USART_ENABLE(__HANDLE__)               ((__HANDLE__)->Instance->CTRL1 |= USART_CTRL1_UEN)

/** @brief  Disable USART
  * @param  __HANDLE__ specifies the USART Handle.
  *         USART Handle selects the USARTx peripheral (USART availability and x value depending on device).
  * @retval None
  */
#define __DAL_USART_DISABLE(__HANDLE__)              ((__HANDLE__)->Instance->CTRL1 &= ~USART_CTRL1_UEN)

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup USART_Exported_Functions
  * @{
  */

/** @addtogroup USART_Exported_Functions_Group1
  * @{
  */
/* Initialization/de-initialization functions  **********************************/
DAL_StatusTypeDef DAL_USART_Init(USART_HandleTypeDef *husart);
DAL_StatusTypeDef DAL_USART_DeInit(USART_HandleTypeDef *husart);
void DAL_USART_MspInit(USART_HandleTypeDef *husart);
void DAL_USART_MspDeInit(USART_HandleTypeDef *husart);

/* Callbacks Register/UnRegister functions  ***********************************/
#if (USE_DAL_USART_REGISTER_CALLBACKS == 1)
DAL_StatusTypeDef DAL_USART_RegisterCallback(USART_HandleTypeDef *husart, DAL_USART_CallbackIDTypeDef CallbackID,
                                             pUSART_CallbackTypeDef pCallback);
DAL_StatusTypeDef DAL_USART_UnRegisterCallback(USART_HandleTypeDef *husart, DAL_USART_CallbackIDTypeDef CallbackID);
#endif /* USE_DAL_USART_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group2
  * @{
  */
/* IO operation functions *******************************************************/
DAL_StatusTypeDef DAL_USART_Transmit(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint16_t Size, uint32_t Timeout);
DAL_StatusTypeDef DAL_USART_Receive(USART_HandleTypeDef *husart, uint8_t *pRxData, uint16_t Size, uint32_t Timeout);
DAL_StatusTypeDef DAL_USART_TransmitReceive(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint8_t *pRxData,
                                            uint16_t Size, uint32_t Timeout);
DAL_StatusTypeDef DAL_USART_Transmit_IT(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint16_t Size);
DAL_StatusTypeDef DAL_USART_Receive_IT(USART_HandleTypeDef *husart, uint8_t *pRxData, uint16_t Size);
DAL_StatusTypeDef DAL_USART_TransmitReceive_IT(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint8_t *pRxData,
                                               uint16_t Size);
DAL_StatusTypeDef DAL_USART_Transmit_DMA(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint16_t Size);
DAL_StatusTypeDef DAL_USART_Receive_DMA(USART_HandleTypeDef *husart, uint8_t *pRxData, uint16_t Size);
DAL_StatusTypeDef DAL_USART_TransmitReceive_DMA(USART_HandleTypeDef *husart, const uint8_t *pTxData, uint8_t *pRxData,
                                                uint16_t Size);
DAL_StatusTypeDef DAL_USART_DMAPause(USART_HandleTypeDef *husart);
DAL_StatusTypeDef DAL_USART_DMAResume(USART_HandleTypeDef *husart);
DAL_StatusTypeDef DAL_USART_DMAStop(USART_HandleTypeDef *husart);
/* Transfer Abort functions */
DAL_StatusTypeDef DAL_USART_Abort(USART_HandleTypeDef *husart);
DAL_StatusTypeDef DAL_USART_Abort_IT(USART_HandleTypeDef *husart);

void DAL_USART_IRQHandler(USART_HandleTypeDef *husart);
void DAL_USART_TxCpltCallback(USART_HandleTypeDef *husart);
void DAL_USART_TxHalfCpltCallback(USART_HandleTypeDef *husart);
void DAL_USART_RxCpltCallback(USART_HandleTypeDef *husart);
void DAL_USART_RxHalfCpltCallback(USART_HandleTypeDef *husart);
void DAL_USART_TxRxCpltCallback(USART_HandleTypeDef *husart);
void DAL_USART_ErrorCallback(USART_HandleTypeDef *husart);
void DAL_USART_AbortCpltCallback(USART_HandleTypeDef *husart);
/**
  * @}
  */

/** @addtogroup USART_Exported_Functions_Group3
  * @{
  */
/* Peripheral State functions  ************************************************/
DAL_USART_StateTypeDef DAL_USART_GetState(USART_HandleTypeDef *husart);
uint32_t               DAL_USART_GetError(USART_HandleTypeDef *husart);
/**
  * @}
  */

/**
  * @}
  */
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup USART_Private_Constants USART Private Constants
  * @{
  */
/** @brief USART interruptions flag mask
  *
  */
#define USART_IT_MASK  ((uint32_t) USART_CTRL1_PEIEN | USART_CTRL1_TXBEIEN | USART_CTRL1_TXCIEN | USART_CTRL1_RXBNEIEN | \
                        USART_CTRL1_IDLEIEN | USART_CTRL2_LBDIEN | USART_CTRL3_CTSIEN | USART_CTRL3_ERRIEN )

#define USART_CTRL1_RXENG_INDEX        1U
#define USART_CTRL2_REG_INDEX          2U
#define USART_CTRL3_REG_INDEX          3U
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup USART_Private_Macros USART Private Macros
  * @{
  */
#define IS_USART_NACK_STATE(NACK)    (((NACK) == USART_NACK_ENABLE) || \
                                      ((NACK) == USART_NACK_DISABLE))

#define IS_USART_LASTBIT(LASTBIT)    (((LASTBIT) == USART_LASTBIT_DISABLE) || \
                                      ((LASTBIT) == USART_LASTBIT_ENABLE))

#define IS_USART_PHASE(CPHA)         (((CPHA) == USART_PHASE_1EDGE) || \
                                      ((CPHA) == USART_PHASE_2EDGE))

#define IS_USART_POLARITY(CPOL)      (((CPOL) == USART_POLARITY_LOW) || \
                                      ((CPOL) == USART_POLARITY_HIGH))

